[
  {
    "id": "4",
    "title": "First Year Engineering Tutor",
    "company": "University of Waterloo",
    "description": "I tutored the BME 121 (Digital Computation) and BME 101L (Visual Communication) courses at the university. I facilitated problem-solving sessions and graded assignments and exams for a cohort of 75 students while providing feedback to course instructors on student progress, thus improving engagement. Through these activities I was able to create a supportive learning environment that encouraged students to actively participate and seek help when needed, ultimately enhancing their understanding of the course material.\nIn addition to my tutoring responsibilities I reinforced my communication and interpersonal skills by interacting with students from diverse backgrounds. This experience allowed me to develop a deeper understanding of different learning styles and adapt my teaching methods accordingly. My attention to detail was crucial in accurately grading assignments and exams ensuring that students received fair and constructive feedback. By collaborating with the course instructors and graduate teaching assistants, I was able to provide valuable insights into student performance and suggest areas for improvement in the curriculum.\nThis role also helped me hone my organizational skills as I managed multiple tasks simultaneously, such as preparing for tutoring sessions, grading, and providing feedback. My strong programming and debugging skills in C++ were essential in assisting students with their coding assignments and troubleshooting errors. This hands-on experience not only solidified my knowledge of C++ but also enhanced my ability to explain complex concepts in a clear and concise manner, making the learning process more accessible for students.",
    "jobWebsite": "https://uwaterloo.ca/",
    "techStack": ["C++", "SolidWorks"],
    "startDate": "2024-08-26",
    "endDate": "2024-12-20"
  },
  {
    "id": "3",
    "title": "Full Stack Developer Intern",
    "company": "PlayTheory Labs",
    "description": "I developed and implemented various enhancements across our data processing and backend architecture, leveraging Python and innovative technologies to drive efficiency and improve user experience. I spearheaded enhancements to our data-collection scripts using cutting-edge techniques such as Large Language Models (LLMs) and Named Entity Recognition (NER), alongside asynchronous functions and multithreading. This initiative resulted in a remarkable 50% reduction in data processing times, while the creation of a validation tool concurrently elevated data accuracy by an impressive 30%.\nI conceptualized and developed an internally utilized data validation tool tailored specifically for our data analysts. Leveraging the versatile MERN stack, I crafted a robust and user-friendly no-code solution to streamline the data validation processes. I also reworked the frontend of webapps built using React JS, leveraging tailwind to use pre-defined customizable classes.\nI augmented product accessibility by developing browser extensions using ReactJS. These extensions provided users with limited yet complementary access to select features, amplifying usability and accommodating diverse user preferences.",
    "jobWebsite": "https://playtheory.xyz/",
    "techStack": ["Python", "JavaScript", "Node JS", "React JS", "AWS (Lambda, EC2, S3, EventBridge)", "Stripe"],
    "startDate": "2023-12-20",
    "endDate": "2024-04-20"
  },
  {
    "id": "2",
    "title": "Software Developer",
    "company": "Escape",
    "description": "I developed a social media application that empowered users to seamlessly share their schedules, create engaging posts, and meticulously plan out events. The post creation feature provided a creative outlet while facilitating engagement through likes, comments, and shares. Moreover, the event planning functionality facilitated the organization of gatherings and meet-ups, allowing users to set event details, send invitations, and efficiently manage RSVPs.\nI used Dart in conjunction with the Flutter framework to develop the frontend. Flutter is a versatile open-source framework that allowed the creation of a consistent user interface across both Android and iOS platforms. Using Flutter Riverpod, a state management library that enhanced data handling, maintained application-wide consistency, and upheld a reliable user experience.\nI used AWS AppSync, a managed GraphQL API service for the backend. Velocity Template Language (VTL) was employed to develop the mapping templates. JavaScript-based AWS Lambda functions handled server-side logic, performing tasks like processing user-generated content, sending notifications, and transforming data.\nAWS DynamoDB was used as the database. The schema allowed the efficient storage of user profiles, posts, schedules, events, and related data. DynamoDB's seamless integration with AWS AppSync ensured data retrieval and storage were highly optimized and synchronized with the GraphQL API.",
    "jobWebsite": "https://www.esc-ape.ca/",
    "techStack": ["Dart", "JavaScript", "VTL", "Flutter", "AWS (AppSync, Lambda)"],
    "startDate": "2023-06-01",
    "endDate": "2023-08-18"
  },
  {
    "id": "1",
    "title": "Computer Vision Engineer",
    "company": "Autogenbot LLP",
    "description": "I designed and implemented a robot computer vision program using Python, which significantly enhanced the accuracy of yield estimation in agricultural fields by being able to detect, count, and diagnose various fruits, resulting in a remarkable 20% improvement compared to traditional area-based estimation methods.\nI initially implemented the YOLOv3 model and later upgraded to YOLOv5. The model demonstrated outstanding performance with a precision of 86.3% and a mean Average Precision (mAP) of 86.5%. This ensured highly reliable identification of different fruits in the field.\nI conducted extensive testing on different hardware platforms, starting with a Raspberry Pi and later transitioning to a Snapdragon 845 based robot. The optimization efforts focused on reducing CPU usage, resulting in a notable 40% increase in frame rate and a 5°C decrease in CPU temperature. This enhanced efficiency allowed the robot to operate more effectively in various environmental conditions.",
    "jobWebsite": "https://air-bots.in/",
    "techStack": ["Python", "ROS (Raspberry Pi)", "Darknet (YOLOv3)", "Ultralytics (YOLOv5)"],
    "startDate": "2023-04-29",
    "endDate": "2023-08-18"
  }
]